# Используем официальный образ Python 3.12 как основу
FROM python:3.12-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями в контейнер
COPY requirements.txt requirements.txt

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь остальной код проекта в рабочую директорию
COPY . .

# Указываем команду, которая будет выполняться при запуске контейнера
# gunicorn - это более надежный веб-сервер для продакшена, чем встроенный во Flask
CMD ["gunicorn", "--bind", "0.0.0.0:5000", "run:app"]